{"id":"video#python-tutorial","lang":"en","url":"https://example.com/videos/python-basics","version":"videoobject.v1","input":"What is this Python tutorial about?","output":"This Python tutorial covers the basics of Python programming for beginners. It's a 45-minute video that teaches fundamental concepts like variables, data types, loops, and functions. The video includes hands-on examples and is suitable for complete beginners with no prior programming experience.","evidence":["https://example.com/videos/python-basics"]}
{"id":"video#python-tutorial-duration","lang":"en","url":"https://example.com/videos/python-basics","version":"videoobject.v1","input":"How long is the Python tutorial video?","output":"The Python tutorial video is 45 minutes long (PT45M). It's designed to be comprehensive yet digestible for beginners, covering all the essential Python concepts in a single session.","evidence":["https://example.com/videos/python-basics"]}
{"id":"video#python-tutorial-content","lang":"en","url":"https://example.com/videos/python-basics","version":"videoobject.v1","input":"What topics does the Python tutorial cover?","output":"The Python tutorial covers: variables and data types, strings and numbers, lists and dictionaries, conditional statements (if/else), loops (for and while), functions and parameters, basic error handling, and practical examples. It's structured for beginners with no programming background.","evidence":["https://example.com/videos/python-basics"]}
{"id":"video#cooking-show","lang":"en","url":"https://example.com/videos/italian-pasta","version":"videoobject.v1","input":"What is this cooking video about?","output":"This is a cooking show video about making authentic Italian pasta dishes. It's a 30-minute episode that demonstrates traditional pasta recipes including carbonara, cacio e pepe, and amatriciana. The video features step-by-step cooking instructions and tips from an Italian chef.","evidence":["https://example.com/videos/italian-pasta"]}
{"id":"video#cooking-show-recipes","lang":"en","url":"https://example.com/videos/italian-pasta","version":"videoobject.v1","input":"What recipes are shown in the Italian pasta cooking video?","output":"The Italian pasta cooking video shows three classic recipes: 1) Spaghetti Carbonara with eggs, pancetta, and pecorino cheese, 2) Cacio e Pepe with black pepper and pecorino, and 3) Bucatini all'Amatriciana with guanciale and tomato sauce. Each recipe includes detailed cooking steps and traditional techniques.","evidence":["https://example.com/videos/italian-pasta"]}
