{"id":"book#python-crash-course","lang":"en","url":"https://example.com/books/python-crash-course","version":"book.v1","input":"What is Python Crash Course about?","output":"Python Crash Course is a comprehensive introduction to Python programming for beginners. It's a 544-page book that covers Python basics, data structures, web development with Django, and data visualization. The book includes hands-on projects and is designed for people with no prior programming experience.","evidence":["https://example.com/books/python-crash-course"]}
{"id":"book#python-crash-course-author","lang":"en","url":"https://example.com/books/python-crash-course","version":"book.v1","input":"Who wrote Python Crash Course?","output":"Python Crash Course was written by Eric Matthes, a high school science and math teacher who has been programming since he was 5 years old. He's also the author of other programming books and maintains the Python documentation.","evidence":["https://example.com/books/python-crash-course"]}
{"id":"book#python-crash-course-content","lang":"en","url":"https://example.com/books/python-crash-course","version":"book.v1","input":"What topics does Python Crash Course cover?","output":"Python Crash Course covers: Python basics and syntax, variables and data types, lists and dictionaries, functions and classes, file handling, testing with unittest, web development with Django, data visualization with matplotlib, and practical projects including a game, web app, and data visualization project.","evidence":["https://example.com/books/python-crash-course"]}
{"id":"book#sapiens","lang":"en","url":"https://example.com/books/sapiens","version":"book.v1","input":"What is Sapiens about?","output":"Sapiens: A Brief History of Humankind is a book by Yuval Noah Harari that explores the history of human civilization from ancient times to the present. It examines how Homo sapiens became the dominant species, the development of agriculture and cities, the rise of empires and religions, and the impact of science and technology on human society.","evidence":["https://example.com/books/sapiens"]}
{"id":"book#sapiens-genre","lang":"en","url":"https://example.com/books/sapiens","version":"book.v1","input":"What genre is Sapiens?","output":"Sapiens is a non-fiction book in the history and anthropology genre. It's written in an accessible, narrative style that makes complex historical concepts understandable to general readers. The book combines insights from multiple disciplines including biology, anthropology, economics, and sociology.","evidence":["https://example.com/books/sapiens"]}
